;=========================================================
; Google翻訳用にクリップボードを操作する
;=========================================================

;---------------------------------------------------
; [内容]
;  英文の改行を削除した状態でクリップボードにコピー
; [使い方]
;  1. 英文を選択しながら、
;  2. Windowsキー + c
;  3. Ctrl + vでGoogle翻訳に貼り付け
;---------------------------------------------------
#c::
    Send, ^c
    Sleep, 1000
    RunWait, python gtcopipe.py copy, , Hide
    Return

;---------------------------------------------------
; [内容]
;  Google翻訳の訳文を整えてペースト
; [使い方]
;  1. Ctrl + cでGoogle翻訳の訳文をコピー
;  2. 貼り付け箇所にカーソルを合わせて、
;  3. Windowsキー + v
;---------------------------------------------------
#v::
    RunWait, python gtcopipe.py paste, , Hide
    Send, ^v
    Return

;=========================================================
;                           END
;=========================================================
